backend/order-service/tests/load-test.yml
config:
  target: 'http://localhost:5002'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Order Service Load Test"
    weight: 100
    flow:
      - get:
          url: "/health"
      - get:
          url: "/api/orders"
      - post:
          url: "/api/orders"
          json:
            userId: 1
            items:
              - productId: 1
                quantity: 2
                price: 9.99
            totalAmount: 19.98
            status: "pending"